<?php
// +----------------------------------------------------------------------
// | 日志设置
// +----------------------------------------------------------------------
return [
    // 默认日志记录通道
    'default'      => 'file',
    // 日志记录级别
    'level'        => ['error'],
    // 日志类型记录的通道 ['error'=>'email',...]
    'type_channel' => [],
    // 日志通道列表
    'channels'     => [
        'file' => [
            // 日志记录方式
            'type'        => 'File',
            // 日志保存目录
            'path'        => '',
            // 单文件日志写入
            'single'      => false,
            // 日志保存目录
            'path'        => App()->getRuntimePath() . 'log',
            // 独立日志级别
            'apart_level' => [],
            // 最大日志文件数量
            'max_files'   => 0,
            // 文件大小限制
            'file_size'   => 1024*1024*5,
            // 使用JSON格式记录
            'json'        => true,
            // 日志记录时间格式
            'time_format' => 'Y-m-d H:i:s',
            // 日志输出格式化
            'format'      => '[%s][%s]:%s',
        ],
        // 其它日志通道配置
    ],
];